#include<reg52.h>
#define uchar unsigned char
#define uint unsigned int
sbit dula=P2^6;
sbit wela=P2^7;

/*独立按键*/
sbit jiasu=P3^0;
sbit jiansu=P3^1;

uint PWM_T=0; //占空比控制变量
uint num;	//num:定时器溢出次数计数

/*子函数定义*/
void keyscan(); //独立键盘扫描
void delayms(uint xms);	//ms级延时
void init();	//初始化

/*******************************************************
******************主函数********************************
*******************************************************/		 
void main()
{
	init();		//初始化函数
	while(1)
	{
		keyscan();		//独立按键扫描
	}
}	


/*******************************************************
******************键盘扫描******************************
*******************************************************/
/*独立键盘扫描*/
void keyscan()
{
 	if(0==jiasu)	 //如果按下了加速按键
	{
		delayms(5);
		if(0==jiasu)   //重复判断确认按下
		{
			if(PWM_T<250)
				PWM_T++;	
		}	
	}
	if(0==jiansu)	 //如果按下了减速按键
	{
		delayms(5);
		if(0==jiansu)	//重复判断确认按下
		{
			if(PWM_T>0)
				PWM_T++;
		}
	}
}


/*******************************************************
******************初始化********************************
*******************************************************/
void init()
{
 	TMOD=0x02;		//设置定时器0工作方式2,8位自动重装
	TH0=210;		//写入预置初值(1~255),数越大PWM频率越高
	TH0=210;		//写入预置值;
    
	ET0=1; 			//开启定时器0中断
	TR0=1;			//打开定时器0
	EA=1;			//开总中断

	P1=0xff;		//初始化P1输出端口
	PWM_T=30;
}


/*******************************************************
******************定时器********************************
*******************************************************/
void T0_time() interrupt 1
{
	num++;	//每溢出一次加一
	
	if(num==250)	//PWM周期,100个单位
	{
		num=0;		//清零num,开始新的PWM周期
		P1=0x00;	//输出端口
	}	
	if(PWM_T==num)	//按照当前的占空比切换输出高电平
	{
		P1=0xff;	
	}
}


/*******************************************************
******************延时函数******************************
*******************************************************/
/*ms级延时函数*/
void delayms(uint xms)
{
	uint i,j;
	for(i=xms;i>0;i--)
		for(j=114;j>0;j--);
}
													  